In [1]:
import pandas as pd
import numpy as np
from IPython.core.interactiveshell import InteractiveShell

InteractiveShell.ast_node_interactivity = "all"

# Question 1

In [2]:
data = {
    "ID": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "Name": [
        "Alice",
        "Bob",
        "Charlie",
        "David",
        "Eva",
        "Frank",
        "Grace",
        "Hannah",
        "Ivy",
        "Jack",
    ],
    "Age": [23, 45, 25, 35, 33, 42, 29, 24, 41, 28],
    "City": [
        "New York",
        "Los Angeles",
        "New York",
        "Chicago",
        "New York",
        "Los Angeles",
        "Chicago",
        "Chicago",
        "New York",
        "Los Angeles",
    ],
    "Score": [85, 67, 93, 45, 78, 82, 74, 66, 89, 77],
}

data = pd.DataFrame(data)
data

   ID     Name  Age         City  Score
0   1    Alice   23     New York     85
1   2      Bob   45  Los Angeles     67
2   3  Charlie   25     New York     93
3   4    David   35      Chicago     45
4   5      Eva   33     New York     78
5   6    Frank   42  Los Angeles     82
6   7    Grace   29      Chicago     74
7   8   Hannah   24      Chicago     66
8   9      Ivy   41     New York     89
9  10     Jack   28  Los Angeles     77

1. Filter the dataset to find all individuals who live in New York

In [3]:
new_york_residents_data = data[data["City"] == "New York"]
new_york_residents_data

   ID     Name  Age      City  Score
0   1    Alice   23  New York     85
2   3  Charlie   25  New York     93
4   5      Eva   33  New York     78
8   9      Ivy   41  New York     89

2. Calculate the average age of individuals in the dataset.

In [4]:
average_age = data["Age"].mean()
average_age

32.5

3. Sort the dataset by the 'Score' column in descending order.

In [5]:
sorted_score_data = data.sort_values(by="Score", ascending=False)
sorted_score_data

   ID     Name  Age         City  Score
2   3  Charlie   25     New York     93
8   9      Ivy   41     New York     89
0   1    Alice   23     New York     85
5   6    Frank   42  Los Angeles     82
4   5      Eva   33     New York     78
9  10     Jack   28  Los Angeles     77
6   7    Grace   29      Chicago     74
1   2      Bob   45  Los Angeles     67
7   8   Hannah   24      Chicago     66
3   4    David   35      Chicago     45

4. Find the maximum score for each city.

In [6]:
city_max_score = data.groupby("City")["Score"].max()
city_max_score

City
Chicago        74
Los Angeles    82
New York       93
Name: Score, dtype: int64

5. Add a new column 'Age Group' to the dataset which categorizes individuals as 'Young' (Age < 30), 'Middle-aged' (30 <= Age < 40), and 'Old' (Age >= 40).

In [7]:
condtions = [
    data["Age"] < 30,
    (data["Age"] >= 30) & (data["Age"] < 40),
    data["Age"] >= 40,
]
choices = ["Young", "Middle-aged", "Old"]
data["Age Group"] = np.select(condlist=condtions, choicelist=choices)
data

   ID     Name  Age         City  Score    Age Group
0   1    Alice   23     New York     85        Young
1   2      Bob   45  Los Angeles     67          Old
2   3  Charlie   25     New York     93        Young
3   4    David   35      Chicago     45  Middle-aged
4   5      Eva   33     New York     78  Middle-aged
5   6    Frank   42  Los Angeles     82          Old
6   7    Grace   29      Chicago     74        Young
7   8   Hannah   24      Chicago     66        Young
8   9      Ivy   41     New York     89          Old
9  10     Jack   28  Los Angeles     77        Young

6. Find the average score for each age group created in the previous question.

In [12]:
average_score_age_group = data.groupby("Age Group")["Score"].mean()
average_score_age_group

Age Group
Middle-aged    61.500000
Old            79.333333
Young          79.000000
Name: Score, dtype: float64

7. Identify the individual(s) with the highest score in each city.

In [24]:
data.loc[data.groupby("City")["Score"].idxmax()]

   ID     Name  Age         City  Score Age Group
6   7    Grace   29      Chicago     74     Young
5   6    Frank   42  Los Angeles     82       Old
2   3  Charlie   25     New York     93     Young

8. Find the difference between the highest and lowest scores in each city.

In [35]:
city_score_max_min_data = data.groupby("City").agg({"Score": ["max", "min"]})
city_score_max_min_data["Score"]["max"] - city_score_max_min_data["Score"]["min"]

City
Chicago        29
Los Angeles    15
New York       15
dtype: int64

9. Create a pivot table that shows the average score and count of individuals for each combination of 'City' and 'Age Group'.

In [ ]:
pd.pivot_table(data=data, )

10. Find the names of individuals who have a score greater than 80.

In [38]:
high_scorers_names = data[data["Score"] > 80]['Name']
high_scorers_names

0      Alice
2    Charlie
5      Frank
8        Ivy
Name: Name, dtype: object

11. Calculate the median age of the individuals.

In [39]:
median_age = data["Age"].median()
median_age

31.0

12. Find the total number of individuals living in each city.

In [10]:
data.groupby(["City"])

13. Calculate the standard deviation of ages for individuals in each city.

14. Filter the dataset to find all individuals who are either younger than 30 or have a score higher than 75.

15. Add a new column 'Score Category' to the dataset which categorizes scores as 'High' (Score > 80), 'Medium' (60 < Score <= 80), and 'Low' (Score <= 60).

In [ ]:
conditions = [
    data["Score"] > 80,
    (data["Score"] <= 80) & (data["Score"] > 60),
    (data["Score"] <= 60),
]
choices = ["High", "Medium", "Low"]

data["Score Category"] = np.select(conditions, choices)
data

16. Identify the city with the highest average score.

17. Find the top three individuals with the highest scores and their respective cities.

In [ ]:
data.loc[data["Score"].nlargest(3).index][["Name", "City"]]

18. Calculate the correlation between 'Age' and 'Score' for each city.

19. Find the individual who has the closest score to the average score of their city.

20. For each age group, determine the individual who has the maximum score and their city.

In [ ]:
data.loc[data.groupby("Age Group")["Score"].idxmax()]

21. Create a new column 'Rank' which ranks individuals within their city based on their score (highest score gets rank 1).

22. Find the number of individuals whose names start with the letter 'A'.

23. Determine the youngest individual in the dataset.

24. Calculate the sum of all scores in the dataset.

In [ ]:
data["Score"].sum()

25. Group the dataset by 'City' and find the average age and average score for each city.

In [ ]:
data.groupby("City")[["Age", "Score"]].mean()

26. Filter the dataset to find individuals whose names have more than 5 characters.

In [ ]:
user_longnames_data = data[data["Name"].str.len() > 5]
user_longnames_data

27. Find the variance in scores for individuals in each age group.

28. Identify the city with the most individuals.

In [ ]:
data.groupby("City").count()

29. Calculate the average score of individuals aged between 30 and 40 (inclusive).

In [ ]:
avg_score_30_40_age = data[(data["Age"] > 30) & (data["Age"] <= 40)]["Score"].mean()
avg_score_30_40_age

30. Find the top 2 cities with the highest average age of their residents.

31. For each city, find the individual with the lowest score.

In [ ]:
lowest_scorers_data = data.loc[data.groupby("City")["Score"].idxmin().values]
lowest_scorers_data

32. Determine if there's a significant difference in the average scores of individuals living in 'New York' vs. 'Los Angeles' using a suitable statistical test.

33. Create a column 'Normalized Score' where each individual's score is normalized within their respective city.

34. Find the individual(s) whose score deviates the most from the average score of their city.

35. Identify if there's a significant correlation between 'Age' and 'Score' across the entire dataset, and interpret the result.

36. Create a summary table that shows the count, mean, median, and standard deviation of ages and scores for each city and each age group.